In [5]:
import numpy as np
import pandas as pd

In [9]:
df = pd.read_csv('spam.csv', encoding='latin1')

In [10]:
df.sample(5)

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
3325,ham,Huh so fast... Dat means u havent finished pai...,NaN,NaN,NaN
5205,spam,Had your mobile 11mths ? Update for FREE to Or...,NaN,NaN,NaN
2885,ham,No probs hon! How u doinat the mo?,NaN,NaN,NaN
2662,spam,Hello darling how are you today? I would love ...,NaN,NaN,NaN
2565,ham,I told her I had a Dr appt next week. She thin...,NaN,NaN,NaN

In [11]:
df.shape

(5572, 5)

## 1.Data Cleaning

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

In [13]:
# Dropping last 3 columns
df.drop(columns=['Unnamed: 2','Unnamed: 3','Unnamed: 4'],inplace=True)

In [14]:
df.sample(5)

       v1                                                 v2
777   ham  \Hi its Kate it was lovely to see you tonight ...
3774  ham  Hi! You just spoke to MANEESHA V. We'd like to...
4464  ham  \CHEERS FOR CALLIN BABE.SOZI CULDNT TALKBUT I ...
842   ham  Our Prashanthettan's mother passed away last n...
4503  ham  She told to hr that he want posting in chennai...

In [15]:
# Renaming the Columns
df.rename(columns={'v1':'target','v2':'text'},inplace=True)
df.sample(5)

     target                                               text
3453    ham  I dont have any of your file in my bag..i was ...
4408   spam  For your chance to WIN a FREE Bluetooth Headse...
2373   spam  XMAS Prize draws! We are trying to contact U. ...
1289    ham  Hey...Great deal...Farm tour 9am to 5pm $95/pa...
1125   spam  For taking part in our mobile survey yesterday...

In [24]:
from sklearn.preprocessing import LabelEncoder
encoder=LabelEncoder()

In [28]:
df['target']=encoder.fit_transform(df['target'])

In [29]:
df.head()

   target                                               text  target_encoded
0       0  Go until jurong point, crazy.. Available only ...               0
1       0                      Ok lar... Joking wif u oni...               0
2       1  Free entry in 2 a wkly comp to win FA Cup fina...               1
3       0  U dun say so early hor... U c already then say...               0
4       0  Nah I don't think he goes to usf, he lives aro...               0